# utils
brew "stow"
brew "fzf"
brew "fd"
brew "jq"
brew "ripgrep"
cask "ngrok"

# development
cask "ghostty"
brew "neovim"
cask "claude-code"
brew "docker"
cask "docker-desktop"
brew "markdownlint-cli"
brew "gh"

# JS/TS development
brew "nvm"
brew "vtsls"

# iOS development
brew "coreutils"
brew "swiftformat"
brew "xcbeautify"
brew "xcode-build-server"
brew "xcp"

# apps
cask "slack"
